# LinkLoadResult Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult Constructor
LinkLoadResult Class See Also
---
Constructs a new uninitialized LinkLoadResult object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LinkLoadResult()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
LinkLoadResult()
```

# See Also
LinkLoadResult Class
LinkLoadResult Overload
Autodesk.Revit.DB Namespace